# 从Mongo shell执行简单查询，投射和分页操作

在本菜谱，我们将动手实现一些查询来从我们之前菜谱_创建测试数据_设置的测试数据查找文档。在本菜谱中没有什么特别难的，并且有查询语句基础的人可以跳过本菜谱。其他对基础查询不是很顺手或者想复习下的人可以继续阅读本菜谱剩余部分。另外，本菜谱认为你对上一个设置测试数据菜谱已经非常熟悉了。


### 前提条件
为了执行简单查询，我们需要服务器已经启动并运行。一个简单的mongo节点就是我们需要的额。参考_第一章，使用命令行选项启动单节点实例_获取如何启动服务器的指导。我们将要操作的数据需要已经导入数据库了。导入数据的步骤已经在前面菜谱_创建测试数据_给出了。你也需要启动mongo shell并连接到运行在本地的服务。一段这些准备条件具备，我们准备好启程了。

### 如何做...
1. 首先让我们统计下集合中文档的总数：
```
> db.postalCodes.count()
```

2. 如下所示，一起从`postalCodes`集合只能怪查找一个文档：
```
> db.postalCodes.findOne()
```

3. 现在，我们在集合中查找多个文档，如下所示：
```
> db.postalCodes.find().pretty()
```

4. 前面的查询将遍历所有键中的前20个文档，并且将他们展示在shell中。在结果的后面，你将会注意到一行写着，输入“it”获取更多。通过输入"it"，mongo shell将会遍历生成的游标。现在让我们做两件事；我们将只显示`city,state`，和`pincode`。另外，我们将显示集合中文档数为91到100的文档。让我们一起看下如何做到：
```
> db.postalCodes.find({}, {_id:0, city:1, state:1, pincode:1}).
skip(90).limit(10)
```

5. 继续往前移步，写个有点复杂的查询，在这个查询中，我们将查找Gujarat省以城市名排序时最靠前的十个城市，另外，类似于上一个 查询，我们只选取`city,state`，和`pincode`这些域：
```
> db.postalCodes.find({state:'Gujarat'},{_id:0, city:1, state:1,
pincode:1}).sort({city:1}).limit(10)
```

### 如何生效...
本菜谱非常简单，并且允许我们自由熟悉上个菜谱导入的测试数据。然而，和其他菜谱一样，我会给你解释在本菜谱中我们做了什么。

我们首先使用`db.postalCodes.
count()`统计了集合中中文档的数目，它将会告诉我们是39732个文档。这应与我们在导入邮政编码集合中的数据时看到的日志同步。我们的下一个查询将是使用`findOne`从集合中获取一个文档。这个方法返回查询集合中的第一个结果。如这里的情况，在缺少查询或者是排序命令的情况下，返回的文档将会是集合中自然排序情况下的第一个文档。

下一步，我们仔细`find`而不是`findOne`。他们两者的区别在于`find`操作返回结果集的迭代器，可以用来遍历整个查找操作的结果，而`findOne`只返回一个文档。调用`find`操作时添加`pretty`方法将以美观或者格式化的方式打印结果。

> 注意`pretty`方法仅在`find`时说得通并且有用，`findOne`则不行。这是因为`findOne`仅返回一个文档，并且`pretty`操作无法应用在返回的单个文档上。

我们现在将在mongo shell中执行下面查询：
```
> db.postalCodes.find({}, {_id:0, city:1, state:1, pincode:1}).skip(90).
limit(10) 
```

这里，我们传递了两个办法给`find`方法：
+ 第一个是`{}`，这个查询选项用来选择文档，并且，在我们这里，我要要求mongo选择所有的文档。

+ 第二个参数是设置我们在结果文档（也被称为项目）需要的域。请记住，默认情况下存在_id字段，除非我们明确说出_id：0（Remember that the _id field is present by default unless we
explicitly say _id:0）。对于所有的其他域来说，我们需要写成` <field_name>:1`或者`<field_name>:true`。对项目的查找操作类似于关系数据世界中的` select
field1, field2 from table`，而不指定在查找中要选择的字段是在关系世界中`select * from table`。

继续，我们只需要看下`skip`和`do`做什么：
+ `skip`的功能是从结果集中跳过给定数目的文档
+ `limit`的功能是限制给定树莓的文档

让我们看下这个例子全部的意思。通过执行`.skip(90).limit(10)`，我们表明我们需要从结果集中跳过前面90个文档，并从第91个文档开始返回。然而，这个限制表明我们将从第91个文档开始返回10个文档。

现在，在这里我们需要知道一些边界条件。如果要跳过的值岛屿集合中文档的总数将会怎么样？好的，在这种情况，将不会返回文档。另外，如果提供的限制文档的数目超重保存在集合中实际文档的数目，将返回集合中保存的文档数目，并且不会抛出异常。